<?php

return [
    /* ... */
    'custom' => [
        'addboat_name' => [
            'required' => 'Поле «Название» обязательно для заполнения',
            'max' => 'Поле «Название» должно быть не больше :max символов',
            'min' => 'Поле «Название» должно быть длиной не менее :min символов',
        ],
        'addboat_country' => [
            'required' => 'Поле «Страна» обязательно для заполнения',
            'max' => 'Поле «Страна» должно быть не больше :max символов',
            'min' => 'Поле «Страна» должно быть длиной не менее :min символов',
        ],
        'addboat_city' => [
            'required' => 'Поле «Город» обязательно для заполнения',
            'max' => 'Поле «Город» должно быть не больше :max символов',
            'min' => 'Поле «Город» должно быть длиной не менее :min символов',
        ],
        'addboat_type' => [
            'required' => 'Поле «Тип лодки» обязательно для заполнения',
            'max' => 'Поле «Тип лодки» должно быть не больше :max символов',
            'min' => 'Поле «Тип лодки» должно быть длиной не менее :min символов',
        ],
        'addboat_year' => [
            'required' => 'Поле «Год выпуска лодки» обязательно для заполнения',
            'max' => 'Поле ««Год выпуска лодки» должно быть не больше :max символов',
            'min' => 'Поле «Год выпуска лодки» должно быть длиной не менее :min символов',
        ],
        'addboat_size' => [
            'required' => 'Поле «Размер яхты в футах» обязательно для заполнения',
            'max' => 'Поле «Размер яхты в футах» должно быть не больше :max символов',
            'min' => 'Поле «Размер яхты в футах» должно быть длиной не менее :min символов',
        ],
        'addboat_guests_qty' => [
            'required' => 'Поле «Общее кол-во гостей» обязательно для заполнения',
            'max' => 'Поле «Общее кол-во гостей» должно быть не больше :max символов',
            'min' => 'Поле «Общее кол-во гостей» должно быть длиной не менее :min символов',
        ],
        'addboat_bedrooms_qty' => [
            'required' => 'Поле «Кол-во спален» обязательно для заполнения',
            'max' => 'Поле «Кол-во спален» должно быть не больше :max символов',
            'min' => 'Поле «Кол-во спален» должно быть длиной не менее :min символов',
        ],
        'addboat_sleepers_qty' => [
            'required' => 'Поле «Спальные места» обязательно для заполнения',
            'max' => 'Поле «Спальные места» должно быть не больше :max символов',
            'min' => 'Поле «Спальные места» должно быть длиной не менее :min символов',
        ],
        'addboat_showers_qty' => [
            'required' => 'Поле «Кол-во душевых» обязательно для заполнения',
            'max' => 'Поле «Кол-во душевых» должно быть не больше :max символов',
            'min' => 'Поле «Кол-во душевых» должно быть длиной не менее :min символов',
        ],
    ],

    'attributes' => [
    'name'                  => 'Имя, Фамилия',
    'slug'                  => 'ЧПУ (англ)',
    'email'                 => 'Адрес почты',
    'password'              => 'Пароль',
    'password_confirmation' => 'Подтверждение пароля',
    'address'               => 'Адрес доставки',
    'phone'                 => 'Номер телефона',
    /* ... */
    ],
];